#define _CRT_SECURE_NO_WARNINGS 1
//课后作业一：将三个整数从大到小输出
//#include<stdio.h>
//int main()
//{
//	int a = 0, b = 0, c = 0;
//	int max = 0, min = 0;
//	printf("Please enter three number:");
//	scanf("%d %d %d", &a, &b, &c);
//	//算法一：两两比较大小，然后交换，a，b，c分别保存最大，中等，最小数字。
//	int temp = 0;
//	if (a < b)
//	{
//		temp = a;
//		a = b;
//		b = temp;
//	}
//	if (a < c)
//	{
//		temp = a;
//		a = c;
//		c = temp;
//	}
//	if (b < c)
//	{
//		temp = b;
//		b = c;
//		c = temp;
//	}
//	printf("从大到小输出：%d %d %d\n", a, b, c);
//	//算法二：分别定义两个变量max,min，保存a,b的最大最小值，然后用第三个数c与max,min分别进行比较；
//	// c 的位置只可能是三种情况：max之前，max与min之间，min之后。
//	//if (a > b)
//	//{
//	//	max = a;
//	//	min = b;
//	//}
//	//else
//	//{
//	//	min = a;
//	//	max = b;
//	//}
//	//if (c > max)
//	//{
//	//	printf("从大到小输出：%d %d %d", c, max, min);
//	//}
//	//else if (c < min)
//	//{
//	//	printf("从大到小输出：%d %d %d", max, min, c);
//	//}
//	//else
//	//{
//	//	printf("从大到小输出：%d %d %d", max, c, min);
//	//}
//	return 0;
//}

//课后作业二：打印1-100之间所有3的倍数
//#include<stdio.h>
//int main()
//{
//	printf("1-100之间所有3的倍数：\n");
//	int i = 0;
//	int count = 0;  //统计输出数字的个数
//	for (i = 1; i <= 100; i++)  //打印1-100之间所有3的倍数
//	{
//		if (i % 3 == 0)
//		{
//			printf("%3d ", i);
//			count++;
//		}
//		if (count == 4)  //每输出4个数，换行一次，为了排版美观
//		{
//			printf("\n");
//			count = 0;
//		}
//	}
//	return 0;
//}

//课后作业三：求两个数的最大公约数（指两个或多个整数共有约数中最大的一个）
//#include<stdio.h>
//int main()
//{
//	int a = 0, b = 0;
//	printf("Please enter two number:");
//	scanf("%d %d", &a, &b);
//	//一、辗转相除法，若a%b的余数c为0，则b为两数的最大公约数；若c不等于0，则a=b，b=c，继续用a整除b，直到余数c=0
//	int c = 0;
//	while (c = a % b)  //若a%b的余数c为0，则b为两数的最大公约数
//	{
//		a = b;
//		b = c;
//	}
//	printf("最大公约数是：%d", b);
//	//二、相减法
//	//while (1)
//	//{
//	//	if (a > b)
//	//	{
//	//		a = a - b;
//	//	}
//	//	else
//	//	{
//	//		b = b - a;
//	//	}
//	//	if (a == b)  //若a=b，则a（或b）为两数的最大公约数
//	//	{
//	//		printf("%d和%d的最大公约数是：%d", a, b, a);
//	//		break;
//	//	}
//	//}
//
//	//算法三：???????????????????????????????????????????
//	//int max = 0;
//	////假设最大公约数是a和b中最大值
//	//if (a > b)
//	//	max = a;
//	//else
//	//	max = b;
//	//while (1)
//	//{
//	//	if ((max % a == 0) && (max % b == 0))
//	//	{
//	//		printf("%d", max);
//	//	}
//	//	max--;
//	//}
//
//
//	return 0;
//}


//最小公倍数 = a*b / 最大公约数???????????????????????????????????

//课后作业四：打印1000年-2000年之间的闰年
/*闰年判断方法：
1.普通年能被4整除，且不能被100整除的为闰年。
2.世纪年能被400整除的为闰年。
*/
//#include<stdio.h>
//int main()
//{
//	printf("打印1000年-2000年之间的闰年：\n");
//	int i = 0;
//	int count = 0;
//	//找出普通年中的闰年
//	for (i = 1000; i <= 2000; i++)  //表示出1000年-2000年之间的年份
//	{
//		//if ((i % 4 == 0) && (i % 100 != 0))
//		//{
//		//	printf("%d ", i);
//		//	count++;
//		//}
//		//if (i % 400 == 0)
//		//{
//		//	printf("%d ", i);
//		//	count++;
//		//}
//		//另外一种好的写法?????????????????????????????????????????????????????????
//		if (((i % 4 == 0) && (i % 100 == 0)) || (i % 400 == 0))
//		{
//			printf("%d ", i);
//			count++;
//		}
//	}
//	printf("\n闰年个数为：%d\n", count);
//	return 0;
//}

//课后作业五：打印100-200之间的素数（素数一般指质数，在大于1的自然数中，除了 1 和它本身以外,不能被其他自然数整除的数）
// 如何判断素数：
// 
//#include<stdio.h>
//int main()
//{
//	printf("打印100-200之间的素数：\n");
//	//算法一：
//	int n = 0;
//	int j = 0;
//	for (n = 100; n <= 200; n++)  //产生100-200的所有数字
//	{
//		for (j = 2; j < n; j++)  //用1到n-1之间所有数字去试，看能不能整除n
//		{
//			if (n % j == 0)  //n能够被2到n-1的数整除，则不为素数
//			{
//				break;
//			}
//		}
//		if (n == j)
//		{
//			printf("%d ", n);
//		}
//	}
//
//	//算法二：
//
//
//
//
//	//算法三：
//	//16=2*8=4*4
//
//	//算法四：
//
//	return 0;
//}

//课后作业选择题：
//#include <stdio.h>
//int main()
//{
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		if (i = 5)
//			printf("%d ", i);  //运行结果：死循环打印5
//	}
//	return 0;
//}


//2021-04-11_2-分支和循环语句(初阶)_作业
//作业一：编写程序数一下 1到 100 的所有整数中出现多少个数字9
//#include<stdio.h>
//int main()
//{
//	int i = 0;
//	int count = 0;
//	for (i = 1; i <= 100; i++)  //产生1-100的整数
//	{
//		//找出个位数为9的数字和十位数为9的数字
//		if (((i % 10) == 9) || (i / 10 == 9))
//		{
//			printf("%d ", i);
//			count++;
//		}
//	}
//	printf("\ncount = %d\n", count);
//	return 0;
//}

//作业二：分数求和
//计算1/1 - 1/2 + 1/3 - 1/4 + 1/5 …… + 1/99 - 1/100 的值，打印出结果
//#include<stdio.h>
//int main()
//{
//	int i = 0;
//	float sum = 0;
//	int t = 1;  //正负号
//	for (i = 1; i <= 100; i++)  //产生100个分母依次递增的分数
//	{
//		sum = sum + t * (1.0 / i);
//		t = -1 * t;
//	}
//	printf("sum = %f\n", sum);
//	return 0;
//}

//作业三：求10 个整数中最大值
//#include<stdio.h>
//int main()
//{
//	int arr[10] = { 21,11,3,14,57,6,7,81,9,10 };  //定义10个整数
//	int max = arr[0];  //假设最大值为arr[0]
//	int i = 0;
//	for (i = 1; i < 10; i++)
//	{
//		//依次比较，找出最大值
//		if (max < arr[i])
//		{
//			max = arr[i];
//		}
//	}
//	printf("max = %d\n", max);
//	return 0;
//}

//作业四：在屏幕上输出9*9乘法口诀表 -------- 第一次没有做出来
#include<stdio.h>
int main()
{
	int i = 0;
	int j = 0;
	for (i = 1; i < 10; i++)  //控制打印多少行
	{
		for (j = 1; j <= i; j++)  //控制每行打印多少个表达式
		{
			printf("%d*%d=%-2d ", i, j, i * j);  //打印表达式内容
		}
		printf("\n");
	}
	return 0;
}

/*作业五：猜数字游戏
1.自动产生一个1-100之间的随机数
2.猜数字
	a.猜对了，恭喜你，游戏结束
	b.猜错了，会告诉猜大了，还是猜小了，继续猜，直到猜对
3.游戏可以一直玩，除非玩家自己选择退出游戏
*/

//void menu()
//{
//	printf("--------------------------\n");
//	printf("------   1 - play   ------\n");
//	printf("------   0 - exit   ------\n");
//	printf("--------------------------\n");
//}
//
//#include<stdio.h>
//int main()
//{
//	while (1)
//	{
//		menu();  //打印游戏菜单
//		printf("请选择：");
//		int input;
//		scanf("%d", &input);
//		
//	}
//	
//	return 0;
//}