#define _CRT_SECURE_NO_WARNINGS 1

//作用域与生命周期
//局部变量的作用域：变量所在的局部范围
//全局变量的作用域：整个工程（在同一工程的其它文件下使用需要用 extern 声明一下变量）
//#include<stdio.h>
//int main()
//{
//	int a = 10;
//	printf("%d\n", a);
//	{
//		int b = 20;  //b的作用域为此 {} 内
//	}
//	//printf("%d\n", b);  //报错："b"是未声明的标识符
//	
//	extern int x;
//	printf("%d\n", x);
//
//	return 0;
//}

//声命周期
//变量的生命周期：变量的创建和销毁之间的时间段
//局部变量的生命周期：进入局部范围生命开始，出局部范围生命结束
//全局变量的生命周期：就是整个程序的生命周期
//#include<stdio.h>
//int main()  //一个程序的生命周期就是 main 函数的生命周期
//{
//	{  //变量 a 声明开始
//		int a = 10;
//		printf("%d\n", a);
//	}  //变量 a 声明结束
//	return 0;
//}

//常量
//字面常量
//#include<stdio.h>
//#define MAX 100
//int main()
//{
//	//1.字面常量
//	3.14;
//	10;
//	'a';
//	"abcdef";
//
//	//2.const修饰的常变量
//	int num1 = 10;  //变量
//	const int num2 = 20;  //常变量 - 具有常属性（不能被改变的属性） - 本质上还是变量，不能当常量使用
//	//num2 = 30;  //error
//
//
//	int arr[10] = { 0 };
//	const int n = 9;
//	//int arr2[n] = { 0 };  //error: n 本质是变量，这里是不行的
//	arr[n] = 10;
//	printf("%d\n", arr[n]);
//
//
//	//3.#define定义的标识符常量
//	//MAX = 200;  //error
//	int x = MAX;
//	printf("%d\n", x);
//
//	//4.枚举常量 - 可以一一列举的常量：比如星期、三原色、性别
//	enum Sex
//	{
//		//枚举常量初始的值  0 1 2 3 …… 依次递增 - 其值不可被更改
//		male=3,    // 0
//		female=100,  // 1
//		secret   // 2
//	};
//	enum Sex s1 = male;
//	printf("%d\n", male);
//	printf("%d\n", female);
//	printf("%d\n", secret);
//
//	return 0;
//}

//课后作业一：将三个整数从大到小输出
//#include<stdio.h>
//int main()
//{
//	int a = 0, b = 0, c = 0;
//	int max = 0, min = 0;
//	printf("Please enter three number:");
//	scanf("%d %d %d", &a, &b, &c);
//	//算法一：两两比较大小，然后交换，a，b，c分别保存最大，中等，最小数字。
//	int temp = 0;
//	if (a < b)
//	{
//		temp = a;
//		a = b;
//		b = temp;
//	}
//	if (a < c)
//	{
//		temp = a;
//		a = c;
//		c = temp;
//	}
//	if (b < c)
//	{
//		temp = b;
//		b = c;
//		c = temp;
//	}
//	printf("从大到小输出：%d %d %d\n", a, b, c);
//	//算法二：分别定义两个变量max,min，保存a,b的最大最小值，然后用第三个数c与max,min分别进行比较；
//	// c 的位置只可能是三种情况：max之前，max与min之间，min之后。
//	//if (a > b)
//	//{
//	//	max = a;
//	//	min = b;
//	//}
//	//else
//	//{
//	//	min = a;
//	//	max = b;
//	//}
//	//if (c > max)
//	//{
//	//	printf("从大到小输出：%d %d %d", c, max, min);
//	//}
//	//else if (c < min)
//	//{
//	//	printf("从大到小输出：%d %d %d", max, min, c);
//	//}
//	//else
//	//{
//	//	printf("从大到小输出：%d %d %d", max, c, min);
//	//}
//	return 0;
//}

//课后作业二：打印1-100之间所有3的倍数
//#include<stdio.h>
//int main()
//{
//	printf("1-100之间所有3的倍数：\n");
//	int i = 0;
//	int count = 0;  //统计输出数字的个数
//	for (i = 1; i <= 100; i++)  //打印1-100之间所有3的倍数
//	{
//		if (i % 3 == 0)
//		{
//			printf("%3d ", i);
//			count++;
//		}
//		if (count == 4)  //每输出4个数，换行一次，为了排版美观
//		{
//			printf("\n");
//			count = 0;
//		}
//	}
//	return 0;
//}

//课后作业三：求两个数的最大公约数（指两个或多个整数共有约数中最大的一个）
//#include<stdio.h>
//int main()
//{
//	int a = 0, b = 0;
//	printf("Please enter two number:");
//	scanf("%d %d", &a, &b);
//	//一、辗转相除法，若a%b的余数c为0，则b为两数的最大公约数；若c不等于0，则a=b，b=c，继续用a整除b，直到余数c=0
//	int c = 0;
//	while (c = a % b)  //若a%b的余数c为0，则b为两数的最大公约数
//	{
//		a = b;
//		b = c;
//	}
//	printf("最大公约数是：%d", b);
//	//二、相减法
//	//while (1)
//	//{
//	//	if (a > b)
//	//	{
//	//		a = a - b;
//	//	}
//	//	else
//	//	{
//	//		b = b - a;
//	//	}
//	//	if (a == b)  //若a=b，则a（或b）为两数的最大公约数
//	//	{
//	//		printf("%d和%d的最大公约数是：%d", a, b, a);
//	//		break;
//	//	}
//	//}
//
//	//算法三：???????????????????????????????????????????
//	//int max = 0;
//	////假设最大公约数是a和b中最大值
//	//if (a > b)
//	//	max = a;
//	//else
//	//	max = b;
//	//while (1)
//	//{
//	//	if ((max % a == 0) && (max % b == 0))
//	//	{
//	//		printf("%d", max);
//	//	}
//	//	max--;
//	//}
//
//
//	return 0;
//}


//最小公倍数 = a*b / 最大公约数???????????????????????????????????

//课后作业四：打印1000年-2000年之间的闰年
/*闰年判断方法：
1.普通年能被4整除，且不能被100整除的为闰年。
2.世纪年能被400整除的为闰年。
*/
//#include<stdio.h>
//int main()
//{
//	printf("打印1000年-2000年之间的闰年：\n");
//	int i = 0;
//	int count = 0;
//	//找出普通年中的闰年
//	for (i = 1000; i <= 2000; i++)  //表示出1000年-2000年之间的年份
//	{
//		//if ((i % 4 == 0) && (i % 100 != 0))
//		//{
//		//	printf("%d ", i);
//		//	count++;
//		//}
//		//if (i % 400 == 0)
//		//{
//		//	printf("%d ", i);
//		//	count++;
//		//}
//		//另外一种好的写法?????????????????????????????????????????????????????????
//		if (((i % 4 == 0) && (i % 100 == 0)) || (i % 400 == 0))
//		{
//			printf("%d ", i);
//			count++;
//		}
//	}
//	printf("\n闰年个数为：%d\n", count);
//	return 0;
//}

//课后作业五：打印100-200之间的素数（素数一般指质数，在大于1的自然数中，除了 1 和它本身以外,不能被其他自然数整除的数）
// 如何判断素数：
// 
//#include<stdio.h>
//int main()
//{
//	printf("打印100-200之间的素数：\n");
//	//算法一：
//	int n = 0;
//	int j = 0;
//	for (n = 100; n <= 200; n++)  //产生100-200的所有数字
//	{
//		for (j = 2; j < n; j++)  //用1到n-1之间所有数字去试，看能不能整除n
//		{
//			if (n % j == 0)  //n能够被2到n-1的数整除，则不为素数
//			{
//				break;
//			}
//		}
//		if (n == j)
//		{
//			printf("%d ", n);
//		}
//	}
//
//	//算法二：
//
//
//
//
//	//算法三：
//	//16=2*8=4*4
//
//	//算法四：
//
//	return 0;
//}

//课后作业选择题：
//#include <stdio.h>
//int main()
//{
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		if (i = 5)
//			printf("%d ", i);  //运行结果：死循环打印5
//	}
//	return 0;
//}

