#define _CRT_SECURE_NO_WARNINGS 1

//作业三：求两个数二进制位中不同位的个数

//编程实现：输入两个整数，求两个整数二进制格式有多少个位不同？
//输入例子：22 33
//输出例子 : 5

//00000000 00000000 00000000 00010110 - 22
//00000000 00000000 00000000 00100001 - 33
//按位异或 ^ （相同为0 相异为1）
//此时得到的二进制的序列 a 中 1 的个数就是两个数二进制位中不同位的个数
//00000000 00000000 00000000 00110111 - 序列 a

//然后再和 1 按位与 &，根据得到的结果，可以判断出最低位是1还是0（按位与结果 = 1 则最低位是 1，按位与结果 = 0 则最低位是 0）
// 00000000 00000000 00000000 00110111 - 序列a
// 00000000 00000000 00000000 00000001
// 00000000 00000000 00000000 00000001 - 按位与结果 = 1 说明最低位是 1

//我们将序列 a 不断地向右移（二进制）位，并和 1 按位与，直到判断完序列 a 的所有二进制位
//这样我们就知道了序列 a 里面多少个 1

//#include<stdio.h>
//int main()
//{
//	int x = 0;
//	int y = 0;
//	int count = 0;
//	//输入两个数
//	scanf("%d %d", &x, &y);
//	//将两数按位异或
//	int z = x ^ y;
//	//将 z 不断地向右移（二进制）位，当 z 二进制序列全为 0 时，即 z = 0，停止循环
//	while (z)
//	{
//		//将 z 与 1 按位与，得到的结果若为 1 说明 z 的最低位为 1 
//		if ((z & 1) == 1)
//		{
//			count++;
//		}
//		//将 z 向右移位
//		z >>= 1;
//	}
//	//输出两个数二进制位中不同位的个数
//	printf("%d\n", count);
//
//	return 0;
//}


//作业四：获取一个整数二进制序列中所有的偶数位和奇数位，分别打印出二进制序列
/*
思路：
1. 提取所有的奇数位，如果该位是1，输出1，是0则输出0
2. 以同样的方式提取偶数位置

检测num中某一位是0还是1的方式：
1. 将num向右移动i位
2. 将移完位之后的结果与1按位与，如果：
	  结果是0，则第n个比特位是0
	  结果是非0，则第n个比特位是1
*/

//void Print_bit(int num)
//{
//	int i = 0;
//	
//	printf("奇数位二进制序列：");
//	for (i = 31; i >= 1; i -= 2)  //获取奇数位
//	{
//		printf("%d", ((num >> i) & 1));
//	}
//	printf("\n");
//	
//	printf("偶数位二进制序列：");
//	for (i = 30; i >= 0; i -= 2)  //获取偶数位
//	{
//		printf("%d", ((num >> i) & 1));
//	}
//	printf("\n");
//}
//
//#include<stdio.h>
//int main()
//{
//	int num = 0;
//
//	printf("请输入一个整数：");
//	scanf("%d", &num);  //输入一个整数
//	
//	Print_bit(num);  //输出奇数和偶数位二进制序列
//	return 0;
//}


//作业五：统计二进制中1的个数
/*
写一个函数返回参数二进制中 1 的个数。
比如：15  -->  4个1
*/

////计算二进制中1的个数
//int Number_bit(int num)
//{
//	int count = 0;
//	while (num)
//	{
//		if ((num & 1) == 1)
//		{
//			count++;
//		}
//		num >>= 1;
//	}
//	return count;
//}
//
//#include<stdio.h>
//int main()
//{
//	int num = 0;
//	printf("请输入一个整数：");
//	scanf("%d", &num);
//
//	printf("二进制中1的个数：");
//	printf("%d\n", Number_bit(num));
//
//	return 0;
//}


//作业六：不允许创建临时变量，交换两个整数的内容
#include<stdio.h>
int main()
{
	int a = 3;
	int b = 5;
	printf("交换前：\n");
	printf("a = %d\n", a);
	printf("b = %d\n", b);

	//算法(1)：可能造成会溢出
	//a = a + b;
	//b = a - b;
	//a = a - b;
	
	//算法(2)：
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;

	printf("交换后：\n");
	printf("a = %d\n", a);
	printf("b = %d\n", b);
	return 0;
}